templates/iforgotwhatthisis.xml


<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:cas="urn:cas.wsapi.broadon.com">
<SOAP-ENV:Body>
<cas:ListContentSets xsi:type="cas:ListContentSetsRequestType">
  <cas:Version>2.0</cas:Version>
  <cas:MessageId>ECDK-*-*</cas:MessageId>
  <cas:DeviceId>*</cas:DeviceId>
  <cas:DeviceToken>*</cas:DeviceToken>
  <cas:AccountId>*</cas:AccountId>
  <cas:ApplicationId>*</cas:ApplicationId>
  <cas:TIN>*</cas:TIN>
  <cas:Region>*</cas:Region>
  <cas:Country>*</cas:Country>
  <cas:Language>*</cas:Language>
  <cas:ListResultOffset>0</cas:ListResultOffset>
  <cas:ListResultLimit>40</cas:ListResultLimit>
  <cas:Attributes>itemTitle</cas:Attributes>
  <cas:Attributes>itemComment</cas:Attributes>
  <cas:Attributes>itemComment2</cas:Attributes>
  <cas:Attributes>itemComment3</cas:Attributes>
  <cas:Attributes>itemComment4</cas:Attributes>
  <cas:Attributes>itemComment5</cas:Attributes>
  <cas:Attributes>itemComment6</cas:Attributes>
  <cas:Attributes>itemVersion</cas:Attributes>
  <cas:Attributes>itemReset</cas:Attributes>
  <cas:Attributes>itemSet</cas:Attributes>
  <cas:Attributes>itemSortKey</cas:Attributes>
  <cas:Attributes>Prices</cas:Attributes>
  <cas:Attributes>MinUserFileSize</cas:Attributes>
  <cas:Attributes>MinUserInodes</cas:Attributes>
  <cas:Attributes>MaxUserFileSize</cas:Attributes>
  <cas:Attributes>MaxUserInodes</cas:Attributes>
  <cas:Attributes>NewSince</cas:Attributes>
  <cas:Attributes>etc, etc</cas:Attributes>
  <cas:AttributeFilters>
    <cas:Name>PricingSelection</cas:Name>
    <cas:Value>RELEASED</cas:Value>
  </cas:AttributeFilters>
  <cas:TitleId>*</cas:TitleId>
</cas:ListContentSets>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
